<template>
  <div>
    <v-dialog v-model="isReShown" transition="dialog-bottom-transition" max-width="1000px">
      <v-card>
        <v-img
          cover
          class="mb-2"
          style="border-radius: 0"
          height="300px"
          :src="recommends[reIndex].cover"
        >
          <v-row no-gutters class="fill-height align-end lightbox">
            <p class="white--text pl-9 pr-9 pb-3">
              {{ recommends[reIndex].info }}
            </p>
          </v-row>
        </v-img>
        <div class="mt-8 mb-6 ml-6 mr-6" style="font-size: 34px; line-height: 1.1">
          <span class="font-weight-bold">{{ recommends[reIndex].name }}</span
          ><br />
          <span class="font-weight-regular" v-if="recommends[reIndex].aka"
            >{{ recommends[reIndex].aka }}&nbsp;</span
          ><br v-if="recommends[reIndex].aka" />
          <span class="font-weight-light grey--text">{{ recommends[reIndex].year }}</span>
        </div>
        <div v-if="reIndex === 0">
          <div class="pl-6 pr-6" style="font-size: 17px; line-height: 1.6">
            <p>
              洛杉矶有我所见过的最美的晚霞，沿着高速公路一直开下去的时候，感觉好像可以越过天际线找到永恒。所以后来我觉得，如果有一天我在这个城市谈恋爱，最浪漫的事情应该就是两个人漫无目的地开车开下去，掠过棕榈树雪山和沙漠，在终于进入黑夜的时候随便找家motel住，店门口要挂着那种闪着廉价荧光的霓虹灯。
            </p>
            <p>
              电影里的洛杉矶美得真让我心碎，她是整部电影里最生动的角色了。Seb和Mia在山丘上看华灯初上，天边玫瑰色的晚霞衬着整座城市闪烁的光，我左手边的朋友说，这是假的吧？当然不是假的了，洛杉矶每座稍微高那么一点的小山头，向远处一望都是这样温柔得发光的夜晚。有一次英语老师给我们布置的作业是放空冥想，我坐在宿舍的小窗户旁边，望着目力所及最远方一小段公路上来往的车辆看了半个小时。来回来去流动的光，他们都要回家了。
            </p>
            <p>
              洛杉矶的浮光掠影都那么肤浅，但是因为浅得实在有点太显而易见，又有点让人心疼。富人区开阔的大道上和宅邸间（一定要配上波光粼粼可以大型轰趴的游泳池），阳光下所有的喧哗和躁动都不是新鲜事，但所有人都觉得自己能给这个世界留下点什么。纽约就不一样，纽约太冷了，大家都被冻得愤世嫉俗，嘴上说着要扬名立万，其实从搬来这里的第一个冬天起就变成了彻头彻尾的虚无主义者。Joan
              Didion说纽约是个只属于年轻人的城市，我觉得这个判断也很适合洛杉矶，她所有虚假的承诺都只适用于二十八岁以下的青年人，如果到了这个年龄还是一事无成，大概就需要重新思考自己的职业规划了，不然一辈子都要耗在十几岁时做过的梦里。别再醉心于派对上琥珀色的酒，套话和奉承，梦想大多是一戳就破的肥皂泡。我的高中接收了很多籍籍无名的中年导演诗人和剧作家，每个人剖析小资产阶级生活无意义的能力都不比每年批评界热捧的新晋宠儿差到哪里去——我曾经的英语老师写的剧本像海滩上清晨的雾气一样美好到惘然。可是有什么用呢？创意产业太残酷了，成功与否有时候只有靠运气，但人是要过日子的，要成家，要生活，要靠从众来拥有一点属于自己的东西。
            </p>
            <p>
              在阳光下，你一直笑，一直笑，直到心底什么东西突然破碎的时候，直到这里所有的谎言没办法再让你假装相信。
            </p>
            <p>
              在洛杉矶当两个爱做梦的年轻人实在是有太多可能性了。La La
              Land选择了其中最单调的一种。有点傻乎乎的少女长成了拿着腔调的妇人，天真鲁莽的青年被突如其来的成功震傻了到最后都没能完全恢复。其实可能比起爱任何人我们最爱的永远是自己，只是我们不愿意承认而已。如果直面了这一点，又会是个多有趣的故事呢。
            </p>
          </div>
          <v-img
            cover
            class="mt-3"
            style="border-radius: 0"
            height="400px"
            src="https://images.weserv.nl/?url=https://img1.doubanio.com/view/photo/l/public/p2374514018.jpg"
          >
            <v-row no-gutters class="fill-height justify-center align-end pl-8 pr-8 pb-8 lightbox">
              <v-btn block height="45" depressed @click="Snackbar.underDev"
                >在{{ siteTitle }}查看详情</v-btn
              >
            </v-row>
          </v-img>
        </div>
        <div v-if="reIndex === 1">
          <div class="pl-6 pr-6" style="font-size: 17px; line-height: 1.6">
            <p>
              电影名《绿皮书》是一本历史上真实存在的黑人出行指南。在 1962
              年，白人至上运动在美国又一次掀起小高潮，黑人邮政员维克多雨果格林编写了这么一本小册子，指出哪些旅店和餐厅可以让黑人入住和就餐。小册子的名字“Green
              Book”中的Green即取自格林（Green），又似乎采用了绿色象征通畅的含义。电影的两位男主角拿着这本绿皮书开车赶往美国各地巡演。一位男主是著名的黑人音乐家唐，一位是混迹夜总会的白人老炮儿托尼，被召来当唐的司机。
              肤色和文化修养上的反差，在旅途上自然产生一些奇妙的化学反应
              。除此之外，电影还展现了很多层面的纠葛：种族歧视、同族不平等、主仆之间、音乐家的社会地位、家庭关系等等。
            </p>
            <p>
              许多反应种族歧视的电影都有一些政治正确的含义在里面，体现在这部电影里，应该是酒吧里音乐家唐喝醉了被一群白人围殴的情节。最后还是托尼（白人司机）以暴制暴，在一堆拳头和一支猎枪枪口下救回了唐。不过，这部电影更伟大之处，是出乎意料地回避了种族之间的直接冲突，转而用一些反转的方式体现了歧视本身。看起来友好的白人，遇到实际问题态度就一百八十度大转弯。例如俩人南下到了一所豪华的庄园。庄园主人很有礼貌地接待了音乐家一行。表演结束后，唐想用洗手间，庄园主人拒绝让他使用给客人用的洗手间，只让他用院子里一个简易棚子搭建的茅坑。因为南方的那个时候，以及农奴解放之前的时代，黑人是不能和白人使用同一间厕所的。即使唐的音乐家身份很高贵，在白宫表演了两次，也不能例外。两人因为托尼打了交警被关监狱的时候，唐打电话给了总统的弟弟，得到上层的“特赦”才出狱。即便是这样的唐，也不能避免受到歧视。另外的一个反差例子来自于两人在伯明翰的一家高档餐厅。餐厅邀请唐去表演，餐厅经理在见到唐的时候，嘴上全是溢美之词，而给唐安排的休息室却是一间狭小的储藏室，也不让唐在餐厅用餐，因为餐厅的规定就是不接待黑人。
            </p>
            <p>
              在我看来，这部电影有一个更加伟大之处。大胆地猜测一下，这部电影也有点为白人“正身”的意味。在旅途的中间，两人的一段对白升华了电影的主题。托尼说，我生长在一个小社会，周围全是我的亲戚和熟人，我没读过什么书，没见过什么世面，不像你受过这么多教育，所以才觉得我这样。这段话原本是反驳唐认为托尼举止过于粗俗、以貌取人的看法，言外之意，我却看到了些在歧视问题上，对歧视者的同情。
            </p>
            <p>
              当代美国可以说是把歧视研究到极致了。刚到美国留学时，遇到学校里的亚裔同学，有英文名加上中文姓。我们有时会习惯地问一下，会问问你会说中文吗
              （要么咱们说中文好交流）或者你是中国人吗。对方沉默了几秒，说：
            </p>
            <p>“我来自密歇根！”。</p>
            <p>然后给个白眼就走了。</p>
            <p>
              有次和同是中国留学生的室友聊天，深感大部分的ABC都很难交流，你上前打个招呼，她随便回应一句转身就走了。室友说，因为他们怕自己被误认为是中国留学生，所以离中国人的圈子都远远的。
            </p>
            <p>
              室友说网上曾经有一个帖子，说那些冷冷的ABC都是从底层移民家庭出来的，早年时期爸妈打黑工摸滚打爬不容易，好不容易落脚了怕又被人当做是保姆和中餐馆服务员，所以要拼命往主流社会靠。而那些随着高学历的父母来移民的ABC倒无所谓，和留学生接触时都主动报出家门，有些硬撑着讲几句中文赢得大家的好感。
            </p>
            <p>
              想想周围基本上也是这个规律。以前我们在国内的时候，也常常有地域歧视、服装歧视、学校歧视。“高攀”大概是每个人或多或少有的心态。城市越小，以貌取人的心态就越严重。他们没有见过太多的世面，按照口音和外貌就给人贴上了标签。
            </p>
            <p>
              前几日听一个白人同事说，她去参加聚会见到一个黑人。那家的公寓都是地毯，所以大家都脱了鞋。她夸对方的袜子上的花纹很好看。黑人说，谢谢，是篮球袜。然后她顺着问：
            </p>
            <p>“你打篮球？”</p>
            <p>“喂，你在歧视我。”黑人很生气地说，</p>
          </div>
          <v-img
            cover
            class="mt-3"
            style="border-radius: 0"
            height="400px"
            src="https://images.weserv.nl/?url=https://img3.doubanio.com/view/photo/l/public/p2542144434.jpg"
          >
            <v-row no-gutters class="fill-height justify-center align-end pl-8 pr-8 pb-8 lightbox">
              <v-btn block height="45" depressed @click="Snackbar.underDev"
                >在{{ siteTitle }}查看详情</v-btn
              >
            </v-row>
          </v-img>
        </div>
        <div v-if="reIndex === 2">
          <div class="pl-6 pr-6" style="font-size: 17px; line-height: 1.6">
            <p>
              老友记一拍十年，十年前几个人住进了一个公寓，早就了十年后的六个老友，以前断断续续的看了一些，只觉得很招乐，这个假期一口气看完了十季，在看最后一季的时候居然有了那种浓浓的不能割舍的感觉，也不能相信这个故事就真的这样终结了。
            </p>
            <p>
              老友记是一部很棒的肥皂剧，喜剧是主色调，但里面很多地方我都是噙着泪看完的，这六个人几乎代表着我们身边的每个人，他们是被放大了的普通人，只是因为他们很认真的工作，很认真的对待友情、亲情、责任，于是十年的历程把他们从第一季里几个不懂事的孩子长成了十季后很幸福很成功的六个人，让人忍不住的向往。
            </p>
            <p>
              十年里 Ross
              虽然依旧是个迷恋恐龙的书呆子博士但终于在三次离婚后勇敢的认清了自己的感情，Joey
              虽然仍然不能与人分享食物，记不住他 ** 的女人，但他至少曾经很认真的爱过
              Rachel，最后一集里他能够那么认真的对 Ross 说那番话真让人觉得那个傻乎乎的 Joey
              长大了。Phoebe
              怪得另类，素食主义者，离奇的身世，似乎有着游戏人生的态度，但对于朋友，对于感情她却有着某种超脱的思路，在雪地里的那场婚礼和对
              Mike 说的那些话真的很“冻人”。Monica
              严谨得甚至有些强迫症，她的好胜真实的不那么令人讨厌，反倒让人觉得可贵，十年后她当了主厨，有了一生的挚爱，有了一对漂亮龙凤胎，那个向
              Chandler 求婚的夜晚，她的泪光比那些阑珊的烛光更摇曳迷人。Chandler
              开玩笑的样子永远让人心里痒痒的，他对于 Joey 的照顾，对于 Monica 的爱，他气吁吁冲到
              Richard 家时吃醋的样子，还有他像 Erica 承诺 Monica
              已经是一个好妈妈，而我也将会是一个好爸爸时候的样子，他向 Monica
              勾勒他们未来住所和孩子以及留给 Joey
              一个房间时的样子，让人不得不为这样一个幽默、有爱、有责任心的男人感动。想想第一集里出现的
              Rachel，一个从自己的婚礼上逃出来的娇气的大小姐，在电话里对爸爸说自己不应该是谁的鞋子为什么自己不可以是一顶帽子对于她来说应该已经是很勇敢的跨越了，但十年后，她在时尚界干着高薪的工作，可以照顾好自己的小
              baby，可以把自己打理得井井有条，甚至可以像 Monica 一样收拾行囊，并最终和 Ross
              走到了一起。
            </p>
            <p>
              最后一集当他们都不得不分道扬镳的时候那些告别时候的感伤不仅仅存在于角色本身，也植根在这些演员的身上，我不过是几天时间一次看完的十季故事就足以让我爱上这六个人，那些追着片子看了十年的人对于老友记的感情自然更深，更别提这六个十年里共同创造老友记奇迹的六个演员了，但庆幸的是每当有人看老友记的时候那些时光就会很自然的回到了那些当下，他们有无数个平行空间可以重新上演那些一幕幕让人们无法忘怀故事。
            </p>
            <p>在我的时空里，我也会像他们一样认真的生活，相信会有同样真挚的情谊。</p>
          </div>
          <v-img
            cover
            class="mt-3"
            style="border-radius: 0"
            height="400px"
            src="https://images.weserv.nl/?url=https://img1.doubanio.com/view/photo/l/public/p863042699.jpg"
          >
            <v-row no-gutters class="fill-height justify-center align-end pl-8 pr-8 pb-8 lightbox">
              <v-btn block height="45" depressed @click="Snackbar.underDev"
                >在{{ siteTitle }}查看详情</v-btn
              >
            </v-row>
          </v-img>
        </div>
        <div v-if="reIndex == 3">
          <div class="pl-6 pr-6" style="font-size: 17px; line-height: 1.6">
            <p>
              谈论宫崎骏的作品是一件不容易的事情，或者说谈论任何一个领域里的传奇人物都是困难的。从《风之谷》到《起风了》，宫崎骏创作生涯的30多部作品，每一部作品都值得反复品味。
            </p>
            <p>
              曾经看过一个访谈，几位影评人在赏析《千与千寻》，主持人问：我们讲了这么久，都在说这部作品的优点，难道它没有什么缺点吗？嘉宾反问主持人：“那你说它有什么缺点呢？”然后大家相视一笑，这个问题不了了之。
            </p>
            <p>
              获得这样的评价跟宫崎骏本身的人物个性是分不开的。一个是由于他的专注于勤奋，从对于配乐的高要求，到坚持手稿创作的习惯，造就了每一个精品。以至于每次电影上映之后，就会涌现大量高品质的壁纸、铃声以及周边玩偶。另一个则是来自于宫崎骏所独有的恢弘的想象力，据说宫崎骏每天早上到达自己的工作室之后，都会面对空无一人的工作室鞠躬并道早上好，因为他认为这个空间之内，也有灵在和人类一起生活。这些细节听起来有些让人毛骨悚然，但是却在影片中表现成为宫崎骏的强烈的个人色彩。
            </p>
            <p>
              对于他的动画，不同的人看总会有不同的感受，这些电影作品不仅仅是为孩子们所创作的，或者说在童年看和长大之后回看很可能会有完全不同的解读和体验。以这部《千与千寻》为例，有人看到了无脸男默默付出的爱情，有人看到了白龙坚守的友情，有人看到了老爷爷的善良，还有人看到了不减肥的严重后果……但是可以统一的是，这一定是一部关乎成长的作品。
            </p>
            <p>
              从人物设定的角度来看，《千与千寻》在宫崎骏的所有作品中是显得独树一帜的。他笔下的主人公，大多数是留着短发，身手干练的女性，即使像《悬崖上的金鱼姬》里波妞那样瘦瘦小小的萌妹子，也是拥有神力的家伙。而千寻却与他们完全不同，影片的开场，千寻与父母一同出行，大大的脑袋显得四肢尤为瘦弱，全程还摆着一副臭脸，是个明显的有心气没能力的青春期少女。在穿过隧道之后，影片正式开始，也拉开了千寻的成长之旅。
            </p>
            <p>
              10岁的千寻当然是脆弱的，尤其是看到父母由于偷吃了给神的食物而变成猪之后，整个人都变得手足无措，这是她这个年纪所无法接受和处理的重大打击。以至于后来白龙在给她饭团的时候，千寻一边吃一边哽咽的哭出声来，因为这个时候的白龙是千寻唯一可以依靠的人了。
            </p>
            <p>
              但是依靠无法解决问题，当千寻意识到自己只有工作才能救回自己父母的时候，她坚持要获得一份工作，面对汤婆婆的百般刁难和侮辱，千寻只是低着头重复一句话：我要在这里工作，这个信念是支撑着她成长的动力。
            </p>
            <p>
              整部影片的展开就是千的成长史（这个时候的她已经被剥夺了名字）。她去服侍别人都避之不及的腐烂大人，去寻找汤婆婆的姐姐，去解救白龙和无脸男，最后鼓起勇气跑过在影片开头她不敢触碰的水管，随着她一跃而下，千已经突破了自己，她已经不是最初那个懵懵懂懂，瘦弱无力的千寻了。
            </p>
            <p>
              关于十几岁花季少女的成长的动画片不在少数，但《千与千寻》是与众不同的，它不像国产动画那样只是简单了狼与羊的大闹；也不是好莱坞式的合家欢大团聚，在《千与千寻》中没有脸谱化的人物，这其中或许也寄托着宫崎骏对于孩子认识这个世界的期望。
            </p>
            <p>
              汤婆婆在面对千寻的时候不留情面，但是在千帮助了腐烂大人之后，她也会真情流露的笑着拥抱千。而在面对大宝宝时候，汤婆婆唯唯诺诺的样子又令人忍俊不禁。这样的例子在影片中俯仰皆是：正直的白龙也会去偷东西；代表着权威的父母也会抵不住诱惑而变成猪；而在传统观念里恐怖威严的鬼怪在影片中却显得人情味十足。他们也会疲劳，也会和普通人一样在闲暇的时候来泡汤放松自己。在千寻第一次跟着白蚕神去汤池的时候，看见那憨态可掬的神灵相信很多观众都忍不住笑了。当然还有无脸男的塑造，他对于千寻的态度和举动，丰富的人物情感以及立体的人物形象与传统的鬼怪截然不同，这里就不一一细表了。
            </p>
            <p>
              其实在宫崎骏的大部分作品中都可以看见他对于自然，神灵的刻画，以及借此传达出来的价值观念。在《千与千寻》中，千找到了腐烂大人身上的一根刺，叫来众人帮忙之后，却拔出来一辆自行车，之后是更多的工业时代的产物。原来腐烂大人是河神，是因为受到了污染才变成人人避之不及的怪物。他为澡堂的人留下了金砂，给了千一颗药丸，这直接推动了之后的剧情发展。可以说千通过自己帮助了河神大人，同时完成了对于自己的救赎，而宫崎骏想借这个桥段表达什么相信是再明显不过了，千何尝不是在帮人类赎罪呢？
            </p>
            <p>
              这样的观念宫崎骏表达过很多次，比如树洞后的世界里居住的只有纯净的孩子才看得见的龙猫，比如《哈尔的移动城堡》（可能是《天空之城》）里愿意为了拯救河谷环境献出生命的主人公，再比如《悬崖上的金鱼姬》里被人类污染所吓倒从而不让波妞接近人类的神……
              不过宫崎骏却很少用大自然的报复或是神灵的处罚来宣扬这样一种观念，反而在他的笔下这些被人类背叛的自然之神都透露出一种友善与宽容。河神会在被帮助之后给人类留下他们最想要的金子，海神会向人类展示她的恢宏壮丽，并给人类与自己女儿共处的机会。宫崎骏一直在寻找的，是人与自然的和解，是人类与这个世界和谐共处的美好愿望。
            </p>
            <p>
              从这个意义上来说，河神的变身还有千与千寻身份的转化，都可以被认为是一种隐喻：在面对世界诱惑的时候，我们往往会被异化，丢失了自己原始的身份。而只有通过成长，通过对自我的突破，才能完成对自己的救赎，达到与世界的和解。
            </p>
            <p>
              据说宫崎骏原本是打算用千寻与白龙和无脸男大战一场作为影片的结局的，但后来觉得不妥就改了，这真是观众的万幸，因为成长本就是一趟没有回程的火车，用一段旅行作为影片的结尾要比一个烂俗的对决好得多。影片的最后，千寻拯救了父母回到最开始的隧道，一切都好像没有发生过一样，但是身为千的那段经历让现在的千寻早已不是之前那个小姑娘了。在隧道的这头，没有腐烂大人，没有险恶的斗争，只有面前一片鸟语花香，而人类何尝不是跟着千寻一起成长了呢？
            </p>
          </div>
          <v-img
            cover
            class="mt-3"
            style="border-radius: 0"
            height="400px"
            src="https://images.weserv.nl/?url=https://img1.doubanio.com/view/photo/large/public/p2557841038.jpg"
          >
            <v-row no-gutters class="fill-height justify-center align-end pl-8 pr-8 pb-8 lightbox">
              <v-btn block height="45" depressed @click="Snackbar.underDev"
                >在{{ siteTitle }}查看详情</v-btn
              >
            </v-row>
          </v-img>
        </div>
        <div v-if="reIndex == 4">
          <div class="pl-6 pr-6" style="font-size: 17px; line-height: 1.6">
            <p>
              作为荣获一九九三年戛纳电影节最高奖项金棕榈奖的电影《霸王别姬》，被认为是陈凯歌导演所拍的最完美的影片。该片场面精致华丽，人物刻画细腻丰满，故事荡气回肠，充分体现了导演驾驭镜头语言的娴熟程度。
            </p>
            <p>
              电影《霸王别姬》讲述了戏子程蝶衣从20年代开始学习唱戏到70年代最后一次在舞台上练唱并最终自刎于他所饰演的“虞姬”最爱的人——楚霸王面前的戏梦人生。程蝶衣与师兄，即楚霸王的饰演者段小楼，共同经历了20年代到70年代这段风雨历程。师兄段小楼跟他感情甚佳，段唱花脸，程唱青衣。两人因合演《霸王别姬》而成为名角，在京城红极一时。两人因合演《霸王别姬》而成为名角，在京城红极一时。蝶衣自小便被灌输“我本是女娇娥”的论断，渐渐长大的他也慢慢接受了这个观点，与师哥产生了雾里看花般的暧昧情愫。很快，这种局面被一个叫菊仙的女子打破……
            </p>
            <p>
              故事的氛围营造可以说非常成功。人物的一举一动，举手投足间满是那个年代的风情，精致的戏服之下缓缓流淌的是惆怅与感伤。作为第五代导演中最懂戏的陈凯歌，多次巧妙地将戏曲完美的勾勒出影片具有中国传统气息的氛围。
            </p>
            <p>
              开头对于“磨剪子嘞…锵菜刀……”的声音和寒冷的冬天北京城的极力描画，表现出浓郁的地方特色，也营造了冷冽而略带悲怆，惆怅而略带苍凉的氛围。画面共三次出现了这充满了京味的叫卖。第一次是在北京灰暗的天空下，风尘女子抱着儿子走进戏班子之前。叫卖被拉得很长，像是画面出现的逼仄胡同。画面以冷色为主，营造了淡淡哀愁的氛围。第二次，在寒气逼人的戏班子外面，女子亲手将儿子怪异的第六指生生的砍去了。暗色的背景，深色的棉袄，与画面上鲜红的血迹形成强烈的视觉冲击。此时的全景镜头缓缓移动，像是一把刀钝钝的，一下一下将人带入刻意营造的带着一丝丝绝望的氛围。画面突然又转向了那逼仄的胡同，京味的叫卖，不得不佩服导演的神来之笔，原本不相关的情节被紧密联系，仿佛“磨剪子嘞…锵菜刀……”的叫卖就是小蝶衣的痛苦叫喊，灰暗的天气就是他内心的阴霾。第三次，是蝶衣挥舞着鲜血淋漓的手，一路跑向师傅的厅堂，摁下了学戏的契约。镜头在交待完拜师之后，又移向了胡同。背景音乐适时出现，舒缓了绝望的氛围。冰冷的冬日在有了音乐的镜头下变得有些暖意，之前情节的跌宕得到了很好的缓解，氛围在傍晚的微醺灯光下变得抒情、夹杂挥之不去的怅然。
            </p>
            <p>
              程蝶衣为日本人唱堂会中杜丽娘的华美唱腔和堂会安静到诡异的气氛，营造了和谐安宁甚至是美好的氛围，在这层表面之下，是巨大的苦楚与压抑。导演用一个移镜头将程蝶衣映在窗前唱戏的身影慢慢呈现，使得巧妙出现了一格一格的移动画面，表情木然的日本士兵把守在门外，这样的画面呈现了流畅的精致之美。画面又回到了堂内。蝶衣的扇若翩跹的蝶纷飞，他的表情是杜丽娘的寂寞：“原来姹紫嫣红开遍，似这般都赋予断壁颓垣。良辰美景奈何天，便伤心乐事谁家院！”眼神早已化为千年一曲戏梦中的伤情，也怪不得捧角儿的袁四爷赐与他“出神入化”的匾额。他的戏梦人生全是为爱伤透了心的女子。所以，他也成了女子，成了虞姬，为情所伤。一曲终了，余音绕梁。可下面竟是一群想体验“生活”的日本兵，他们礼貌的用白手套鼓掌，“啪、啪”，沉闷的声音使屋内的氛围变得古怪而沉闷，这是中国历史悠久的梨园文化与日本只会欺凌别国、根本不了解京剧的士兵所碰撞的必然结果。导演苦心安排了一个叫青木的官员，他懂戏。程蝶衣这样的戏痴，将他看成是上宾。以致几乎忘了他的初衷——他是为了救师哥段小楼而被迫唱的戏。在堂会中，青木第一个鼓掌，表现了对于蝶衣的首肯，后来鼓掌的近景镜头让画面呈现略微繁复之感。蝶衣的痛苦，蝶衣对于青木也懂戏的兴奋，在大堂沉闷鼓掌声中交织在一起，巨大的苦楚与压抑在整个空间化成无形的网，压向程蝶衣。
            </p>
            <p>
              影片的最高潮，程蝶衣声嘶力竭的控诉，菊仙绝望的眼神，段小楼口不对心的呈述罪状，将故事的氛围推向了最高峰，营造了斗争激烈、悲愤绝望的氛围。文革时期人性的丑恶，师兄弟之间的情愫，戏子与妓女的爱情，都在那个火盆面前，扑向了盛大的死亡。程蝶衣被压倒在火盆前，妆花了一脸。他望着说着他罪状的段小楼，面部的特写让蝶衣内心活动表现在脸上，惊诧、失望、绝望，从那双眼睛里，所说着太多太多。他突然站起来，“我也揭发，揭发姹紫嫣红，揭发断壁颓垣！段小楼，你，自从和这个女人成亲之后，我就知道完了。全完了。……”从他的语无伦次里，从红卫兵“打倒一切牛鬼蛇神！”里，从菊仙惊恐的表情里，所有人性的丑恶，都在这阳光下暴露无遗。陈凯歌导演用人的角度审视了这一场文化浩劫，用直白的几乎像记录片的镜头，表现中国下九流的“职业”中的戏子与妓女不被中国人所认同，营造了悲愤的、绝望氛围。
            </p>
            <p>
              寂寞的戏梦已伤千年。舞台上的蝶衣表情决绝，一把抽出“霸王”段小楼腰际中的宝剑。程蝶衣在戏中完成了最美的轮回，而霸王，一如千年之前的错愕。
            </p>
          </div>
          <v-img
            cover
            class="mt-3"
            style="border-radius: 0"
            height="400px"
            src="https://images.weserv.nl/?url=https://img3.doubanio.com/view/photo/large/public/p2497595173.jpg"
          >
            <v-row no-gutters class="fill-height justify-center align-end pl-8 pr-8 pb-8 lightbox">
              <v-btn block height="45" depressed @click="Snackbar.underDev"
                >在{{ siteTitle }}查看详情</v-btn
              >
            </v-row>
          </v-img>
        </div>
      </v-card>
    </v-dialog>

    <div class="pt-4 pa-lg-4">
      <div>
        <div class="text-3xl font-bold ml-5 mt-lg-4">编辑精选</div>
        <ImageSlider class="pt-3 pt-lg-5">
          <div v-for="(item, index) in recommends.slice(0, 5)" :key="index">
            <div class="align-left justify-left" style="width: 100%">
              <h2 class="text-2xl font-semibold">{{ item.name }}</h2>
              <h5 class="text-xl mb-5 grey--text">{{ item.tip }}</h5>
            </div>
            <v-card flat @click="showRecommend(index)">
              <v-img cover :height="recommendHeight" :width="recommendWidth" :src="item.cover">
                <v-row no-gutters class="fill-height w-full align-end lightbox">
                  <p class="white--text pl-9 pr-9 pb-3">
                    {{ recommends[index].info }}
                  </p>
                </v-row>
              </v-img>
            </v-card>
          </div>
        </ImageSlider>
      </div>
      <v-divider class="ma-8" />

      <v-divider class="ma-8" />
      <div>
        <h1 class="text-3xl font-bold ml-5">影视分类</h1>
        <ImageSlider class="pt-4">
          <div v-for="(i, index) in movies" :key="index">
            <v-card flat @click="findMovie(i.name)">
              <v-img cover height="150" width="200" :src="i.cover">
                <v-row no-gutters class="fill-height align-end lightbox">
                  <p class="white--text pl-4 pb-2" style="font-size: 18px">
                    {{ i.name }}
                  </p>
                </v-row>
              </v-img>
            </v-card>
          </div>
        </ImageSlider>
      </div>
      <v-divider class="ma-8" />
      <div>
        <h1 class="text-3xl font-bold ml-5">{{ siteTitle }}-读书</h1>
        <ImageSlider class="pt-4">
          <div v-for="(i, index) in books" :key="index">
            <v-card flat>
              <v-img cover height="300" width="200" :src="i.cover" />
            </v-card>
            <div class="align-left justify-left mt-2">
              <h5 class="text-xl mb-5 grey--text">{{ i.name }}</h5>
            </div>
          </div>
        </ImageSlider>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
import { onMounted } from 'vue';
import { useDisplay } from 'vuetify';
import { updateTitle } from '~/utils/ui';
import { Snackbar } from '../utils/snackbar';
import { siteTitle } from '~/config/strings';
import { recommends } from '~/assets/lolipop/recommends';
import { movies } from '~/assets/lolipop/movies';
import { books } from '~/assets/lolipop/books';

onMounted(() => {
  updateTitle('Lolipop');
});

let isReShown = ref(false);
let reIndex = ref(0);

function showRecommend(index: number) {
  reIndex.value = index;
  isReShown.value = true;
}

function findMovie(name: string) {
  window.open('https://www.douban.com/search?cat=1002&q=' + name);
}

const recommendHeight = computed<string>((): string => {
  const { name } = useDisplay();
  switch (name.value) {
    case 'xs':
    case 'sm':
      return '200px';
    case 'md':
      return '250px';
    case 'lg':
      return '375px';
    case 'xl':
      return '400px';
  }
  return '0';
});

const recommendWidth = computed<string>((): string => {
  const { name } = useDisplay();
  switch (name.value) {
    case 'xs':
    case 'sm':
      return '400px';
    case 'md':
      return '500px';
    case 'lg':
      return '750px';
    case 'xl':
      return '800px';
  }
  return '0';
});
</script>

<style lang="scss" scoped>
html {
  .v-dialog {
    border-radius: 1rem;
  }
  .v-img {
    border-radius: 1rem;
  }
}
.lightbox {
  color: white;
  background-image: linear-gradient(to top, rgba(0, 0, 0, 0.9) 0%, transparent 100px);
}

.fill-height {
  height: 100%;
}
</style>
